# შექმენი ცვლადი my_number და მიაწერე რიცხვი 10. დაბეჭდე ცვლადის მნიშვნელობა.

my_number = 10

print(my_number)


#შექმენი ცვლადი my_text და მიაწერე მას ტექსტი "Hello, World!". დაბეჭდე ცვლადის ტიპი.

my_text = "Hello, World!"

print(my_text)

#შექმენი ორი ცვლადი num1 და num2, და მიაწერე მათ 5 და 15. დაბეჭდე მათ ჯამი.

num1 = 5
num2 = 15

#5+15=20

print(str(num1) + " + " + str(num2) + " = " + str(num1 + num2))

#შექმენი ორი ცვლადი first_name და last_name და მიაწერე მათ შესაბამისი სახელები. დაბეჭდე ორივე ერთად.

first_name = "Vitali"
last_name = "Katsadze"

print(first_name + " " + last_name)


#შექმენი ცვლადი age და მიაწერე მას 8. შემდეგ შეცვალე მისი მნიშვნელობა 9-ზე და დაბეჭდე ახალი მნიშვნელობა.  

age = 8

print(age + 1)

#შექმენი ცვლადი, str_num და შეინახეთ “10”, მოცემული ცვლადი გადაიყვანეთ ინტეჯერში და შემდეგ გაამრავლეთ ექვსზე







#შექმენი ცვლადები num1 და num2, ამ ცვლადებში შეინახეთ: “10” და “5”, შემდეგ გადაიყვანეთ ინტეჯერებში და გადაამრავლეთ

num1 = " 10 "
num2 = " 5 "

print(num1 + " + " + num2 + " = " + str(int(num1) * int(num2)))


#შექმენით რამოდენიმე ცვლადი მინიმუმ 5 რომლებშიც შეინახავთ რიცხვებს შემდეგ კი დაბეჭდეთ მათი საშუალო არითმეტიკული.

num1 = 20
num2 = 30
num3 = 21
num4 = 5
num5 = 3

#20+30+21+5+3=79

print(str(num1) + " + " + str(num2) + " + " + str(num3) + " + " + str(num4) + " + " + str(num5) + " = " + str(num1 + num2 + num3 + num4 + num5))


