my_list = ["giorgi", "daviti", "luka", "nika", "levana"]

#print(my_list.index("nika")) #ეს არის მარტივი გზა

index = 0 
for element in my_list:
    if element == "levana":
        print(index)

    index += 1    #ეს არის ჩადური გზა chad

#ჩვენი ნასწავლი სიები:
#append - ამ ფუნქციით ვამატებთ ელემენტს ოღონდ ბოლოში
#remove - ამ ფუნქციით ვშლით ნებისმიერ ელემენტს
#pop - ეს არის removes მსგავის გადახტომა გამოტოვება
#insert - ამ ფუნქციით ნებისმიერ ადგილას შეგვიძლია ელემენტის დამატება
#extend - ამ ფუნქციით ჩვენ შეგვიძლია ჩვენი სიების გაერთიანება რამდენიც გვინდა
#index - ამ ფუნქციით შეგვიძლია გავიგოთ ჩვენი ელემენტი მერამდენა სიაში
#len - ამ ფუნქციით შეგვიძლია გავიგოთ რამდენი ელემენტია სიაში
#count - სიაში თუ ერთიდაიგივე ელემენტი არის ბევრჯერ გვიწერს თუ რამდენია















#შევქმნათ პროგრამა რომელიც დაგვიბრუნებს რომელ ინდექსზე დგას კოკნრეტული ელემენტი სიაში