//კომენტარის სახით ახსენით, თუ როგორ მუშაობს EventListener-ები და მოიყვანეთ მისი გამოყენების ერთ-ერთი მაგალითი;

//dom eventlistener - ჩვენ შეგვიძლია რომ html ის დოკუმენტიდან წამოვიღოთ გარკვეული ელემენტები და მათ გავუწეროთ addEventlistener, და ეს რას აკეთებს ამას შეგვიძლია არგუმენტად გადავცეთ მოვლენა და ასევე რა განახორციელოს ამ მოვლენის შემდეგ მეორე არგუმენტად გადავცემტ ფუნქციას რომელსაც რასაც გვინდა იმას გავაკეტებინებთ, ზოგადად სამი არგუმენტიც გადაეცრმა ხოლმე true and false მარა იშვიათად ვიყენებთ ამას ნუ როცა დაგვჭირდება მაშინ ვიყენებთ. პირველ არგუმენტად შეგვიძლია გადავცეთ click and mousover ზოგადად კიდე გადაეცემა რარაცეები მარა ეს ორი არის ყველაზე ხშირად გამოყენებადი. click ის გამოყენებისას მაუსზე დაწკაპების შემდეგ იცვლება და mouseover ის დროს მაუსის გადატარებისას

let myh1 = document.getElementById("myh1");
myh1.addEventListener("click", function(){
    myh1.textContent = "lesson 80"
    myh1.style.color = "red"
})